package task5.constants;

public interface NumberWordsArray {
    String[][] WORDS ={{"", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"},
            {"", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"},
            {"", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"},
            {"", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"}};
    String[][] END_NUMBER_WORDS ={ {"", "", ""},
            {"тысяча", "тысячи", "тысяч"},
            {"миллион","миллиона", "миллионов"},
            { "миллиард", "миллиарда", "миллиардов"},
            { "триллион", "триллиона", "триллионов"},
            { "квадриллион", "квадриллиона", "квадриллионов"},
            { "квинтиллион", "квинтиллиона", "квинтиллионов"},
            { "секстиллион", "секстиллиона", "секстиллионов"},
            { "септиллион", "септиллиона", "септиллионов"},
            { "октиллион", "октиллиона", "октиллионов"},
            { "нониллион", "нониллиона", "нониллионов"},
            { "дециллион", "дециллиона", "дециллионов"},};
    String ZERO = "ноль";
    String MINUS = "минус";

}
